{
  "entries": [
    {
      "date": "2020-12-09",
      "concepts": "EventListeners",
      "entry": "Working again with Event Listeners and a local API. It is starting to make a lot more sense now that I have used it quite a bit more. Also getting used to modularizing my code, particularly JavaScript. Additionally, I have been keeping in mind the importance of de-coupling when possible (This is the process of keeping code relevant to a certain functionality nearly or completely separate from other code and only allowing anonymous communication via eventListeners.",
      "id": 1,
      "moodId": 3
    },
    {
      "date": "2020-12-10",
      "concepts": "Databases",
      "entry": "I started watching a few videos on databases today. Learned about the importance of \"normalizing\" your database in order to reduce redundancies and avoid (insertion, deletion & modification) abnormalities. Some main elements of a database include Entities (Customer, Products, Orders) their related attributes (customerId, name, address, phone#) and the relationships between each entity. Each entity will have one unique \"primary key\" that represents the entirety of the data table. When the primary key of one entity is referenced in another entity, that key is considered a \"foreign key\" in the location it is being called to. There can only be one primary key per entity, but an entity can have any amount of foreign keys.",
      "id": 5,
      "moodId": 3
    },
    {
      "date": "2020-12-11",
      "concepts": "Holiday Road ",
      "entry": "Started a new project named Holiday Road with three others (Nicholas Douso, Christine Doza & Anna Moore). The main objective of the project is to gain a better understanding of dealing with a large amount of data from multiple API's. Two of the API's are from NSS (Attractions and Eateries) while a couple come from external sources (Weather & Parks). We also will be using event listeners quite a lot with this project to maintain the decoupling principle between our JS modules. Today, about halfway through the day, we started by determining dependencies, then drawing them out on the DOM. We also worked on preparing an eventListener Diagram so that we could see the data flow. We did not work on any code, all of the time we spend on the project today was for planning.",
      "id": 6,
      "moodId": 2
    }
  ],
  "moods": [
    {
      "id": 1,
      "label": "elated"
    },
    {
      "id": 2,
      "label": "happy"
    },
    {
      "id": 3,
      "label": "normal"
    },
    {
      "id": 4,
      "label": "sad"
    },
    {
      "id": 5,
      "label": "depressed"
    }
  ]
}